// Написать программу на языке С#
// для Windows и MacOS в которую пользователь 
// вводит два целых числа?
// в которой записаны два целых? числа?
// два целых? числа генерируются случайным образом?
// и получает сумму
// АЛГОРИТМ
// Начало
// Определить numberA
// Определить numberB
// Вывод numberA + numberB
// Конец

int namberA = 3;
int namberB = 5;
Console.WriteLine(namberA + namberB);

int result = namberA + namberB;
Console.WriteLine(result);